Revit 2027 API
MechanicalSystem.Create(Document, ElementId) Method
 Creates a new instance of a mechanical system and adds it to the document.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static MechanicalSystem Create(
	Document ADocument,
	ElementId typeId
)
Public Shared Function Create (
	ADocument As Document,
	typeId As ElementId
) As MechanicalSystem
public:
static MechanicalSystem^ Create(
	Document^ ADocument,
	ElementId^ typeId
)
static member Create :
        ADocument : Document *
        typeId : ElementId -> MechanicalSystem
Parameters
ADocument Document
 The document where the element will be created and added.
typeId ElementId
 The identifier of this mechanical system element's type.
Return Value
MechanicalSystem
 The newly created mechanical system element.
Exceptions
Exception | Condition
ArgumentException |  The typeId is not an element id for a valid mechanical system type.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MechanicalSystem Class
Create Overload
Autodesk.Revit.DB.Mechanical Namespace